CF/AccumulationRegisters/РасчетыСПоставщиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПоставщиками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОплате</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПоступлению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СторноЗаказаПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Взаимозачет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CF/AccumulationRegisters/ДенежныеСредстваКВыплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваКВыплате</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РаспоряжениеНаРасходованиеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CF/Enums/ФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ФормыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Взаимозачет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/CommonForms/СведенияОбОплате/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Ссылка = Параметры.Ссылка;
	ЗаполнитьСписокОплат(Ссылка);
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТабличнойЧастиСписокОплат

&НаКлиенте
Процедура СписокОплатВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИмяПоле = Поле.Имя;
	ИмяРеквизита = СтрЗаменить(Поле.Имя, "СписокОплат", "");
	
	Если ИмяРеквизита <> "ДокументОплаты" Тогда
		Возврат;
	КонецЕсли;
	
	Значение = Элемент.ТекущиеДанные[ИмяРеквизита];
	Если ЗначениеЗаполнено(Значение) Тогда
		ПоказатьЗначение(,Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокОплат(ДокументРасчета)
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ДокументРасчета) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		Запрос.Текст =  "ВЫБРАТЬ
		|	РасчетыСПоставщикамиОбороты.Регистратор КАК ДокументОплаты,
		|	ВЫБОР
		|		КОГДА РасчетыСПоставщикамиОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|	КОНЕЦ КАК ФормаОплаты,
		|	РасчетыСПоставщикамиОбороты.КОплатеРасход КАК Сумма
		|ПОМЕСТИТЬ Оплата
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Обороты(, , Регистратор, ДокументРасчета = &ДокументРасчета) КАК РасчетыСПоставщикамиОбороты
		|ГДЕ
		|	РасчетыСПоставщикамиОбороты.Регистратор <> РасчетыСПоставщикамиОбороты.ДокументРасчета
		|	И (РасчетыСПоставщикамиОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		|			ИЛИ РасчетыСПоставщикамиОбороты.Регистратор ССЫЛКА Документ.РегистрацияБезналичнойОплаты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Оплата.ДокументОплаты КАК ДокументОплаты,
		|	Оплата.ФормаОплаты,
		|	Оплата.Сумма
		|ИЗ
		|	Оплата КАК Оплата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументОплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА Оплата.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|				ТОГДА Оплата.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Наличные,
		|	СУММА(ВЫБОР
		|			КОГДА Оплата.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				ТОГДА Оплата.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Безналичные,
		|	СУММА(Оплата.Сумма) КАК Итого
		|ИЗ
		|	Оплата КАК Оплата";
		
	ИначеЕсли ТипЗнч(ДокументРасчета) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		
		Запрос.Текст ="ВЫБРАТЬ
		|	ДенежныеСредстваКВыплатеОбороты.Регистратор КАК ДокументОплаты,
		|	ВЫБОР
		|		КОГДА ДенежныеСредстваКВыплатеОбороты.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|	КОНЕЦ КАК ФормаОплаты,
		|	ДенежныеСредстваКВыплатеОбороты.СуммаПриход КАК Сумма
		|	ПОМЕСТИТЬ Оплата
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваКВыплате.Обороты(, , Регистратор, РаспоряжениеНаРасходованиеДенежныхСредств = &ДокументРасчета) КАК ДенежныеСредстваКВыплатеОбороты
		|ГДЕ
		|	ДенежныеСредстваКВыплатеОбороты.СуммаПриход > 0;
		|	
		|	
		|	////////////////////////////////////////////////////////////////////////////////
		|		ВЫБРАТЬ
		|			Оплата.ДокументОплаты КАК ДокументОплаты,
		|			Оплата.ФормаОплаты,
		|			Оплата.Сумма
		|		ИЗ
		|			Оплата КАК Оплата
		|		
		|		УПОРЯДОЧИТЬ ПО
		|			ДокументОплаты
		|		;
		|		
		|		////////////////////////////////////////////////////////////////////////////////
		|		ВЫБРАТЬ
		|			СУММА(ВЫБОР
		|					КОГДА Оплата.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|						ТОГДА Оплата.Сумма
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК Наличные,
		|			СУММА(ВЫБОР
		|					КОГДА Оплата.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|						ТОГДА Оплата.Сумма
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК Безналичные,
		|			СУММА(Оплата.Сумма) КАК Итого
		|		ИЗ
		|			Оплата КАК Оплата";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыСПоставщикамиОбороты.Регистратор КАК ДокументОплаты,
		|	ВЫБОР
		|		КОГДА РасчетыСПоставщикамиОбороты.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|	КОНЕЦ КАК ФормаОплаты,
		|	РасчетыСПоставщикамиОбороты.КОплатеПриход КАК Сумма
		|ПОМЕСТИТЬ Оплата
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками.Обороты(, , Регистратор, ДокументРасчета = &ДокументРасчета) КАК РасчетыСПоставщикамиОбороты
		|ГДЕ
		|	РасчетыСПоставщикамиОбороты.Регистратор <> РасчетыСПоставщикамиОбороты.ДокументРасчета
		|	И (РасчетыСПоставщикамиОбороты.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
		|			ИЛИ РасчетыСПоставщикамиОбороты.Регистратор ССЫЛКА Документ.РегистрацияБезналичнойОплаты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Оплата.ДокументОплаты КАК ДокументОплаты,
		|	Оплата.ФормаОплаты,
		|	Оплата.Сумма
		|ИЗ
		|	Оплата КАК Оплата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументОплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА Оплата.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличная)
		|				ТОГДА Оплата.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Наличные,
		|	СУММА(ВЫБОР
		|			КОГДА Оплата.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				ТОГДА Оплата.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Безналичные,
		|	СУММА(Оплата.Сумма) КАК Итого
		|ИЗ
		|	Оплата КАК Оплата";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументРасчета", ДокументРасчета);
	
	Результат = Запрос.ВыполнитьПакет();
	
	СписокОплат.Загрузить(Результат[1].Выгрузить());
	
	Если НЕ Результат[2].Пустой() Тогда
		Выборка = Результат[2].Выбрать();
		Выборка.Следующий();
		Итого = Выборка.Итого;
		ИтогоНаличными = Выборка.Наличные;
		ИтогоБезналичными = Выборка.Безналичные;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
